# Borrower reliability study

## Open the table and learn general information about the data

**Import the library Pandas and store the dataframe in a variable**

In [1]:
import pandas as pd
data = pd.read_csv('data.csv')

**Output the first 20 rows of the dataframe**

In [2]:
data.head(20)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу
5,0,-926.185831,27,высшее,0,гражданский брак,1,M,компаньон,0,255763.565419,покупка жилья
6,0,-2879.202052,43,высшее,0,женат / замужем,0,F,компаньон,0,240525.971920,операции с жильем
7,0,-152.779569,50,СРЕДНЕЕ,1,женат / замужем,0,M,сотрудник,0,135823.934197,образование
8,2,-6929.865299,35,ВЫСШЕЕ,0,гражданский брак,1,F,сотрудник,0,95856.832424,на проведение свадьбы
9,0,-2188.756445,41,среднее,1,женат / замужем,0,M,сотрудник,0,144425.938277,покупка жилья для семьи
10,2,-4171.483647,36,высшее,0,женат / замужем,0,M,компаньон,0,113943.491460,покупка недвижимости
11,0,-792.701887,40,среднее,1,женат / замужем,0,F,сотрудник,0,77069.234271,покупка коммерческой недвижимости
12,0,NaN,65,среднее,1,гражданский брак,1,M,пенсионер,0,NaN,сыграть свадьбу
13,0,-1846.641941,54,неоконченное высшее,2,женат / замужем,0,F,сотрудник,0,130458.228857,приобретение автомобиля
14,0,-1844.956182,56,высшее,0,гражданский брак,1,F,компаньон,1,165127.911772,покупка жилой недвижимости
15,1,-972.364419,26,среднее,1,женат / замужем,0,F,сотрудник,0,116820.904450,строительство собственной недвижимости
16,0,-1719.934226,35,среднее,1,женат / замужем,0,F,сотрудник,0,289202.704229,недвижимость
17,0,-2369.999720,33,высшее,0,гражданский брак,1,M,сотрудник,0,90410.586745,строительство недвижимости
18,0,400281.136913,53,среднее,1,вдовец / вдова,2,F,пенсионер,0,56823.777243,на покупку подержанного автомобиля
19,0,-10038.818549,48,СРЕДНЕЕ,1,в разводе,3,F,сотрудник,0,242831.107982,на покупку своего автомобиля

**Display basic information about the dataframe**

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

## Data preprocessing

### Deletion of gaps

**Output the number of missing values for each columns**

In [4]:
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

Two columns have missing values: **days_employed**, **total_income**. Processed missing values first in column 'total_income' and then in column 'days_employed'

**total_income \
Fill in the missing values with the median from each group**

In [5]:
for t in data['income_type'].unique():
    data.loc[(data['income_type'] == t) & (data['total_income'].isna()), 'total_income'] = \
    data.loc[(data['income_type'] == t), 'total_income'].median()

### Processing of abnormal values

**There are negative values of seniority in the data. We need to replace them with positive values.**

In [6]:
data['days_employed'] = data['days_employed'].abs()

**Display the median value of seniority for each type of employment**

In [7]:
data.groupby('income_type')['days_employed'].agg('median')

income_type
безработный        366413.652744
в декрете            3296.759962
госслужащий          2689.368353
компаньон            1547.382223
пенсионер          365213.306266
предприниматель       520.848083
сотрудник            1574.202821
студент               578.751554
Name: days_employed, dtype: float64

Columns 'безработный' and 'пенсионер' have abnormally high values. We don't need this data, so we won't delete it.

In [8]:
data['children'].unique()

array([ 1,  0,  3,  2, -1,  4, 20,  5])

**Remove anomalous value in column 'children'**

In [9]:
data = data[(data['children'] != -1) & (data['children'] != 20)]

**Make a check**

In [10]:
data['children'].unique()

array([1, 0, 3, 2, 4, 5])

### Deletion of gaps (again)

**days_employed \
Fill in the missing values with the median from each group**

In [11]:
for t in data['income_type'].unique():
    data.loc[(data['income_type'] == t) & (data['days_employed'].isna()), 'days_employed'] = \
    data.loc[(data['income_type'] == t), 'days_employed'].median()

**Make a check**

In [12]:
data.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

### Changing data types

**Change real type to integer type in column 'total_income'**

In [13]:
data['total_income'] = data['total_income'].astype(int)

### Duplicate Handling

**Output the number of rows of duplicates in the data**

In [14]:
data.duplicated().sum()

54

**Delete duplicates**

In [15]:
data = data.drop_duplicates()

**Remove implicit duplicates in column 'education'**

In [16]:
data['education'] = data['education'].str.lower()

In [17]:
data = data.drop_duplicates()

**Make a check**

In [18]:
data.duplicated().sum()

0

### Data categorization

**Create column 'total_income_category' containig categories:**

- 0–30000 — `'E'`;
- 30001–50000 — `'D'`;
- 50001–200000 — `'C'`;
- 200001–1000000 — `'B'`;
- 1000001 и выше — `'A'`.

In [19]:
def categorize_income(income):
    try:
        if 0 <= income <= 30000:
            return 'E'
        elif 30001 <= income <= 50000:
            return 'D'
        elif 50001 <= income <= 200000:
            return 'C'
        elif 200001 <= income <= 1000000:
            return 'B'
        elif income >= 1000001:
            return 'A'
    except:
        pass

In [20]:
data['total_income_category'] = data['total_income'].apply(categorize_income)

**Display unique values of column 'purpose'**

In [21]:
data['purpose'].unique()

array(['покупка жилья', 'приобретение автомобиля',
       'дополнительное образование', 'сыграть свадьбу',
       'операции с жильем', 'образование', 'на проведение свадьбы',
       'покупка жилья для семьи', 'покупка недвижимости',
       'покупка коммерческой недвижимости', 'покупка жилой недвижимости',
       'строительство собственной недвижимости', 'недвижимость',
       'строительство недвижимости', 'на покупку подержанного автомобиля',
       'на покупку своего автомобиля',
       'операции с коммерческой недвижимостью',
       'строительство жилой недвижимости', 'жилье',
       'операции со своей недвижимостью', 'автомобили',
       'заняться образованием', 'сделка с подержанным автомобилем',
       'получение образования', 'автомобиль', 'свадьба',
       'получение дополнительного образования', 'покупка своего жилья',
       'операции с недвижимостью', 'получение высшего образования',
       'свой автомобиль', 'сделка с автомобилем',
       'профильное образование', 'высшее образование',
       'покупка жилья для сдачи', 'на покупку автомобиля', 'ремонт жилью',
       'заняться высшим образованием'], dtype=object)

**Create column 'purpose_category' containig categories:**

- `'операции с автомобилем'`,
- `'операции с недвижимостью'`,
- `'проведение свадьбы'`,
- `'получение образования'`.

In [22]:
def categorize_purpose(row):
    try:
        if 'автом' in row:
            return 'операции с автомобилем'
        elif 'жил' in row or 'недвиж' in row:
            return 'операции с недвижимостью'
        elif 'свад' in row:
            return 'проведение свадьбы'
        elif 'образов' in row:
            return 'получение образования'
    except:
        return 'нет категории'

In [23]:
data['purpose_category'] = data['purpose'].apply(categorize_purpose)

## Explore data and answer questions

**The relationship between the number of children and loan repayment on time.**

In [24]:
data_pivot = data.pivot_table(index=['children'], values='debt', aggfunc='count')
data_pivot

           debt
children
0         14091
1          4808
2          2052
3           330
4            41
5             9

In [25]:
data_pivot = data.pivot_table(index=['children'], values='debt', aggfunc='sum')
data_pivot

          debt
children
0         1063
1          444
2          194
3           27
4            4
5            0

In [26]:
data_pivot = data.pivot_table(index=['children'], values='debt', aggfunc='mean')
data_pivot

              debt
children
0         0.075438
1         0.092346
2         0.094542
3         0.081818
4         0.097561
5         0.000000

**Conclusion:** \
The most risky group is the group two children

**The relationship between marital status and loan repayment on time**

In [27]:
data_pivot = data.pivot_table(index=['family_status'], values='debt', aggfunc='count')
data_pivot

                        debt
family_status
Не женат / не замужем   2796
в разводе               1189
вдовец / вдова           951
гражданский брак        4134
женат / замужем        12261

In [28]:
data_pivot = data.pivot_table(index=['family_status'], values='debt', aggfunc='sum')
data_pivot

                       debt
family_status
Не женат / не замужем   273
в разводе                84
вдовец / вдова           63
гражданский брак        385
женат / замужем         927

In [29]:
data_pivot = data.pivot_table(index=['family_status'], values='debt', aggfunc='mean')
data_pivot

                           debt
family_status
Не женат / не замужем  0.097639
в разводе              0.070648
вдовец / вдова         0.066246
гражданский брак       0.093130
женат / замужем        0.075606

**Conclusion:** \
The most risky group is the group 'not married'

**The relationship between income level and loan repayment on time.**

In [30]:
data_pivot = data.pivot_table(index=['total_income_category'], values='debt', aggfunc='count')
data_pivot

                        debt
total_income_category
A                         25
B                       5014
C                      15921
D                        349
E                         22

In [31]:
data_pivot = data.pivot_table(index=['total_income_category'], values='debt', aggfunc='sum')
data_pivot

                       debt
total_income_category
A                         2
B                       354
C                      1353
D                        21
E                         2

In [32]:
data_pivot = data.pivot_table(index=['total_income_category'], values='debt', aggfunc='mean')
data_pivot

                           debt
total_income_category
A                      0.080000
B                      0.070602
C                      0.084982
D                      0.060172
E                      0.090909

**Conclusion:** \
The most risky group is the group E

**The relationship between the abjectives of the loan and repayment of the loan on time.**

In [33]:
data_pivot = data.pivot_table(index=['purpose_category'], values='debt', aggfunc='count')
data_pivot

                           debt
purpose_category
операции с автомобилем     4279
операции с недвижимостью  10751
получение образования      3988
проведение свадьбы         2313

In [34]:
data_pivot = data.pivot_table(index=['purpose_category'], values='debt', aggfunc='sum')
data_pivot

                          debt
purpose_category
операции с автомобилем     400
операции с недвижимостью   780
получение образования      369
проведение свадьбы         183

In [35]:
data_pivot = data.pivot_table(index=['purpose_category'], values='debt', aggfunc='mean')
data_pivot

                              debt
purpose_category
операции с автомобилем    0.093480
операции с недвижимостью  0.072551
получение образования     0.092528
проведение свадьбы        0.079118

**Conclusion:** \
The most risky group is the group 'car operations'

**General conclusion** \
The dataset contains the necessary and sufficient amount of data to answer the question: \
Which population groups are the most risky for the bank?